src/main/resources/doAirDocIssue_KKCokYolcu_IsBankasi.text

<?xml version="1.0"?> <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.iata.org/IATA/EDIST/2017.2"><soapenv:Header/><soapenv:Body><AirDocIssueRQ xmlns="http://www.iata.org/IATA/EDIST/2017.2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="xmldsig-core-schema.xsd" Version="IATA2017.2"><Document><Name>PC NDC GATEWAY</Name></Document><Party xmlns="http://www.iata.org/IATA/EDIST/2017.2"><Sender><TravelAgencySender><Contacts><Contact><EmailContact><Address>xxxa@xxx.com.tr</Address></EmailContact></Contact></Contacts><AgencyID>PC NDC</AgencyID><AgentUser><Name>NDCTEST</Name><AgentUserID>T621OC48</AgentUserID><UserRole>ADMIN</UserRole></AgentUser></TravelAgencySender></Sender><Participants xsi:nil="true"/><Recipient xsi:nil="true"/></Party><Query><TicketDocQuantity>3</TicketDocQuantity><TicketDocInfo><PassengerReference>SH1</PassengerReference><Payments><Payment><Type>CC</Type><Method><PaymentCard><CardNumber>4282209004348015</CardNumber><SeriesCode>000</SeriesCode><CardHolderName>ECEM UNLU</CardHolderName><EffectiveExpireDate><Expiration>1226</Expiration></EffectiveExpireDate></PaymentCard></Method><Amount Code="TRY">replacePrice</Amount><Order OrderID="replaceOrder" Owner="PC"/></Payment></Payments></TicketDocInfo><TicketDocInfo><PassengerReference>SH1</PassengerReference></TicketDocInfo><DataLists><PassengerList><Passenger PassengerID="SH1"><PTC>ADT</PTC><Birthdate>1990-01-01</Birthdate><ResidenceCountryCode>TR</ResidenceCountryCode><Individual><GivenName>CENGIZHAN</GivenName><Surname>YILMAZ</Surname></Individual><IdentityDocument><IdentityDocumentNumber/><IdentityDocumentType/></IdentityDocument><ContactInfoRef>CONT1</ContactInfoRef><InfantRef>SH3</InfantRef></Passenger><Passenger PassengerID="SH2"><PTC>CHD</PTC><Birthdate>2016-01-01</Birthdate><ResidenceCountryCode>TR</ResidenceCountryCode><Individual><GivenName>COCUK</GivenName><Surname>YILMAZ</Surname></Individual><IdentityDocument><IdentityDocumentNumber/><IdentityDocumentType/></IdentityDocument><ContactInfoRef>CONT1</ContactInfoRef></Passenger><Passenger PassengerID="SH3"><PTC>INF</PTC><Birthdate>2022-01-01</Birthdate><ResidenceCountryCode>TR</ResidenceCountryCode><Individual><GivenName>BEBEK</GivenName><Surname>YILMAZ</Surname></Individual><IdentityDocument><IdentityDocumentNumber/><IdentityDocumentType/></IdentityDocument><ContactInfoRef>CONT1</ContactInfoRef></Passenger></PassengerList></DataLists></Query></AirDocIssueRQ></soapenv:Body></soapenv:Envelope>
